---
title: MullionTypeSet
classe: Autodesk.Revit.DB.MullionTypeSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# MullionTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `mullionTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `mullionTypeSet.Size` | Int32 |
| `Void Clear()` | `mullionTypeSet.Clear()` | Void |
| `Boolean Contains(MullionType)` | `mullionTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(MullionType)` | `mullionTypeSet.Erase(item)` | Int32 |
| `MullionTypeSetIterator ForwardIterator()` | `mullionTypeSet.ForwardIterator()` | MullionTypeSetIterator |
| `IEnumerator GetEnumerator()` | `mullionTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(MullionType)` | `mullionTypeSet.Insert(item)` | Boolean |
| `MullionTypeSetIterator ReverseIterator()` | `mullionTypeSet.ReverseIterator()` | MullionTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```